
// 1 Категоря - Масла для компрессоров холодильных установок
// Продукт - LC FROST SE
// Вязкости - 10 / 20 / 30 / 40 / 50 / 60
//     Размер Канистр: 10 / 20 / 30
//     Размер Бочки: 200
// Продукт - LC FROST AB
// Вязкости - 10 / 20 / 30 / 40 / 50 / 60
//     Размер Канистр: 10 / 20 / 30
//     Размер Бочки: 200
// Продукт - LC FROST PAG
// Вязкости - 10 / 20 / 30 / 40 / 50 / 60
//     Размер Канистр: 10 / 20 / 30
//     Размер Бочки: 200

// 2 Категория - Масла для газовых компрессоров
// Продукт - LC CompressGas PAG
// Вязкости - 10 / 20 / 30 / 40 / 50 / 60
//     Размер Канистр: 10 / 20 / 30
//     Размер Бочки: 200

// 3 Категория - Масла для вакуумных насосов
// Продукт - LC VacuumOil VE
// Вязкости - 10 / 20 / 30 / 40 / 50 / 60
//     Размер Канистр: 10 / 20 / 30
//     Размер Бочки: 200

// 4 Категория - Масла для перекачки воздуха и газа
// Продукт - LC CompressOil SE
// Вязкости - 10 / 20 / 30 / 40 / 50 / 60
//     Размер Канистр: 10 / 20 / 30
//     Размер Бочки: 200
// Продукт - LC CompressOil SE - A
// Вязкости - 10 / 20 / 30 / 40 / 50 / 60
//     Размер Канистр: 10 / 20 / 30
//     Размер Бочки: 200

// 5 Категория - Масла для промывки компрессоров
// Продукт - LC CompressClean - WG
// Вязкости - 10 / 20 / 30 / 40 / 50 / 60
//     Размер Канистр: 10 / 20 / 30
//     Размер Бочки: 200
// Продукт - LC CompressClean - WH
// Вязкости - 10 / 20 / 30 / 40 / 50 / 60
//     Размер Канистр: 10 / 20 / 30
//     Размер Бочки: 200

// 6 Категория - Цепные масла
// Продукт - LC ChainOil SE
// Вязкости - 10 / 20 / 30 / 40 / 50 / 60
//     Размер Канистр: 10 / 20 / 30
//     Размер Бочки: 200