import React from 'react';
import './Privacy.css';
import PageBody from '../../components/PageBody/PageBody';

export const Privacy: React.FC = () => {

  return (
    <PageBody>
      <div className='privacy'>
        <span className='privacy-title'>Политика конфиденциальности</span>
        <ol>
          <li>
          Общие положения
          </li>
          <div>
             {/*// todo EDIT */} 
            <span>Настоящие Положение о политике конфиденциальности (далее — Положение) является официальным документом ООО «ЛУБРИКОР» (далее — «Компания»), и определяет порядок обработки и защиты информации о физических лицах (далее — Пользователи), пользующихся информацией, услугами, продуктами, расположенными на доменном имени https:// (далее — Сайт).</span>
            <span>Данная Политика Конфиденциальности описывает способ осуществления обработки персональных данных,  совершаемых с использованием средств автоматизации или без использования таких средств с персональными   данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение),   извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование,   удаление, уничтожение персональных данных.</span>
            <span>Отношения, связанные с обработкой персональных данных и информации о пользователях Сайта, регулируются  настоящим документами Компании и действующим законодательством РФ, в т. ч. Федеральным законом от 27.07.2006   N 152-ФЗ «О персональных данных», Постановлением Правительства Р Ф от 15.09.2008 N 687 «Об утверждении  Положения об особенностях обработки персональных данных, осуществляемой без использования средств  автоматизации», Постановлением Правительства Р Ф от 17.11.2007 N 781 «Об утверждении Положения об  обеспечении безопасности персональных данных при их обработке в информационных системах персональных данных».  </span>
          </div>

          <li>
          Сбор персональных данных
          </li>
          <div>
            <span>
            Целью обработки персональных данных является выполнения обязательств Компании перед Пользователями в отношении использования Сайта и его сервисов. Обработка персональных данных Пользователей осуществляется только с согласия субъекта персональных данных на обработку его персональных данных. Под персональными данными понимается любая информация, относящаяся определяемому физическому лицу (субъекту персональных данных) и которая может быть использована для идентификации определенного лица либо связи с ним.
            </span>
            <span>Компания может запросить у Пользователя персональные данные в любой момент, когда Пользователь связывается с Компанией. Ниже приведены некоторые примеры типов персональных данных, которые Компания может собирать, и способ их использования.</span>
            <span>Компания может собирать различные данные/информацию, включая:</span>
            <ul>
              <li>имя и фамилию</li>
              <li>дату рождения</li>
              <li>пол, семейное положение</li>
              <li>почтовый адрес, номер телефона</li>
              <li>адрес электронной почты</li>
              <li>информацию об избранных контактах</li>
              <li>информацию о банковских картах (ФИО, № карты).</li>
            </ul>
            <span>Персональные данные могут также включать в себя дополнительно предоставляемые Пользователями по запросу Компании в целях исполнения Компании обязательств перед Пользователями, вытекающих из договора на оказание услуг. При обработке персональных данных обеспечивается точность персональных данных, их достаточность, а в необходимых случаях и актуальность по отношению к целям обработки персональных данных.</span>
          </div>

          <li>Хранение и использование персональных данных</li>
          <div>
            <span>При сборе персональных данных Пользователя через Сайт Компания обеспечивает запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение персональных данных Пользователя с использованием баз данных, находящихся на территории Российской Федерации.</span>
            <span>Компания имеет право обрабатывать и хранить персональные данные Пользователя не дольше, чем этого требуют цели обработки персональных данных, изложенные в настоящим разделе (за исключением случаев, предусмотренных законодательством Российской Федерации). Персональные данные, которые собирает Компания, позволяют направлять Пользователю уведомления о новых продуктах, специальных предложениях и различных событиях, а также помогают улучшать услуги, контент и коммуникации Компании.</span>
            <span>Пользователь имеет право отказаться от рассылки в любое время путём информирования Компании по указанным контактам для обратной связи. Компания также имеет право использовать персональную информацию для внутренних целей, таких как: проведение аудита, анализ данных и различных исследований в целях улучшения продуктов и услуг Компании, а также взаимодействие с потребителями.</span>
          </div>

          <li>Передача персональных данных</li>
          <div>
            <span>При сборе персональных данных через Сайт Компания обеспечивает запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение персональных данных с использованием баз данных, находящихся на территории Российской Федерации.</span>
            <span>Обработка персональных данных Пользователя осуществляется без ограничения срока, любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств.</span>
            <span>Пользователь соглашается с тем, что Компания вправе передавать персональные данные третьим лицам, в частности, курьерским службам, организациями почтовой связи, операторам электросвязи, и т. д., исключительно для целей, указанных в разделе «Сбор персональных данных».</span>
            </div>

            <li>Уничтожение персональных данных</li>
            <div>
              <span>Персональные данные Пользователя уничтожаются при:</span>
              <ul>
                <li>
                удалении Компанией информации, размещаемой Пользователем, а также персональной страницы Пользователя в случаях, установленных договором (оферта);
                </li>
                <li>при отзыве субъектом персональных данных согласия на обработку персональных данных.</li>
              </ul>
            </div>

            <li>Идентификационные файлы (сookies) и иные технологии</li>
            <div>
              <span>Веб-сайт, интерактивные услуги и приложения, сообщения электронной почты и любые иные коммуникации от лица Компании могут использовать идентификационные файлы (cookies), пиксельные ярлыки (pixel tags), веб-маяки (web beacons) и иные технологии.</span>
            <span>Пользователь имеет право отключить cookies в настройках используемого веб-браузера или мобильного устройства (некоторые функции веб-сайта могут стать недоступными после отключения cookies). Компания имеет право собирать некоторую информацию автоматически и хранить её в файлах статистики. Такая информация включает в себя адрес Интернет-протокола (IP-адрес), тип и язык браузера, информацию о поставщике Интернет-услуг, страницы отсылки и выхода, сведения об операционной системе, отметку даты и времени, а также сведения о посещениях. Компания имеет право использовать такую информацию для понимания и анализа тенденций, администрирования сайта, изучения поведения пользователей на сайте и сбора демографической информации о основных посетителях сайта. Компания оставляет за собой право использовать такую информацию в своих маркетинговых целях.</span>
            </div>
            
            <li>
              Защита персональных данных
            </li>
            <div>
              <span>Компания предпринимает необходимые меры предосторожности для обеспечения защиты персональных данных Пользователя в соответствии со ст. 19 Федерального закона от 27.07.2006 N 152-ФЗ «О персональных данных». Во всем остальном, что не отражено напрямую в Политике Конфиденциальности, Компания руководствоваться нормами и положениями Федерального закона от 27.07.2006 N 152-ФЗ «О персональных данных».</span>
            </div>
        </ol>
      </div>
    </PageBody>
  );
};
